{
  "header": {
    "nameAndSurname": "Grzegorz Martowski",
    "langPl": "PL",
    "langEn": "EN"
  },
  "navbar": {
    "home": "Home",
    "career": "Experience",
    "about": "About",
    "contact": "Contact"
  },
  "home": {
    "title": "Responsive Web Apps",
    "intro": "Designer"
  },
  "about": {
    "experience": "I became interested in programming in 2011, still in college. I started as a web publisher in a large corporation, later in several smaller companies as a Web Developer.",
    "experience1": "I worked on both business applications based on the Zend, Symfony and Laravel frameworks, and I did static pages based on CMS Wordpress in cooperation with graphics.",
    "experience2": "From 4 years on B2B, and from 3 as Front-end Developer.",
    "experience3": "After the initial adventures with jQuery and AngularJS, I focused on working with the ReactJS framework - or else; I am at the stage of fascination with this tool",
    "codingIsFun": "Programming is not only a job for me, but also great fun! After starting the adventure with React, I think that geography can be really nice.",
    "interestedIn": "In my free time I devote myself to a different passion - photography, I also like football very much, which I have been playing regularly for over 20 years :)",
    "cvFile": "Grzegorz_Martowski_CV_EN.pdf"
  },
  "modal": {
    "close": "Close"
  },
  "career": {
    "details": "Details",
    "period": {
      "avra": "JANUARY 2016 - NOW",
      "makrologic": "OCTOBER 2014 - JANUARY 2016",
      "stabsoft": "JUNE 2014 - NOW",
      "greenline": "MAY 2014 - DECEMBER 2014",
      "funmedia": "OCTOBER 2013 - MAY 2014",
      "creditsuisse": "JULY 2012 - APRIL 2013"
    },
    "responsibilities": {
      "avra": {
        "first": "Maintenance and implementation of Front-End projects,",
        "second": "CSS / LESS implementation in products based on Java and JSP technology,",
        "third": "Work on projects using technologies and tools such as: GIT, LESS, Webpack, ES6, ReactJS, Jest + Enzyme."
      },
      "makrologic": {
        "first": "Maintenance and implementation of Front-End projects,",
        "second": "CSS / LESS implementation in products based on Java and JSP technology,",
        "third": "Work on projects using technologies and tools such as: GIT, LESS, Gulp or AngularJS."
      },
      "stabsoft": {
        "first": "Designing websites based on CMS Wordpress,",
        "second": "Cutting PSD, cooperation with graphics,",
        "third": "The use of the latest web technologies (Laravel, Bootstrap / Foundation, SASS / LESS, jQuery / AngularJS)."
      },
      "greenline": {
        "first": "Update and develop Front-End company websites",
        "second": "Programming changes in the business logic of the platform based on the Zend framework,",
        "third": "Designing new company websites in cooperation with the graphic designer."
      },
      "funmedia": {
        "first": "Update and development of the frontend of e-learning courses,",
        "second": "Programming changes in the business logic of the platform based on the Zend framework,",
        "third": "Implementation of work related to data mining on MySQL databases,"
      },
      "creditsuisse": {
        "first": "Performing publishing tasks; updating and developing company websites,",
        "second": "Programming online forms, registering bank clients,",
        "third": "Participation in the migration of websites to the new content management system,",
        "fourth": "Work in a multicultural team,",
        "fifth": "Acquired skills on the position: Developing knowledge of the jQuery library and the CMS system, contact and cooperation with foreign clients."
      }
    }
  }
}

